1. Какие основные особенности делают Python популярным среди начинающих программистов по вашему мнению?  
2. Что означает термин «динамическая типизация» в контексте Python?  
3. Перечислите основные встроенные типы данных в Python.  
4. Как объявить переменную в Python? Приведите пример.  
5. Можно ли в Python изменить тип переменной после её объявления? Почему?  
6. Какой символ используется для комментариев в Python?  
7. Как правильно производить интерполяцию(вставку значений в текст) в Python?  
8. Какой синтаксис используется для конструкции if в Python?  
9. Как проверить несколько условий одновременно? Приведите пример с использованием and и or.  
10. Обязательно ли использовать else вместе с if?  
11. Какую роль выполняет ключевое слово elif?  
12. Что будет выведено в результате выполнения следующего кода:  
if 0:  
    print("Ноль")  
else:  
    print("Не ноль")  
13. Какой синтаксис у цикла while в Python?  
14. Как избежать бесконечного цикла при использовании while? А как намеренно сделать его бесконечным и зачем это может пригодится?
15. Что произойдёт, если условие в while изначально будет False?

Доп. вопросы, ответы на которые вы не должны знать:
16. Какой вид типизации используется в пайтон?
17. Какой тип языка Python: компилируемый или интерпретируемый?
18. Какое определение дают языку Python?    
19. Какая философия лежит в основе Python?